Revit 2026 API

# TableSectionDataGetRowHeightInPixels Method

---

This returns a row's height in logical pixels

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetRowHeightInPixels(
	int nRow
)
```
```vb
Public Function GetRowHeightInPixels (
	nRow As Integer
) As Integer
```
```cpp
public:
int GetRowHeightInPixels(
	int nRow
)
```
```fsharp
member GetRowHeightInPixels :
        nRow : int -> int
```

#### Parameters

nRow Int32

#### Return Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | The given row number nRow is invalid. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace